<#if copyright?exists>
/*
{*****************************************************************************
{  ${projectLabel} v${copyright.version}													
{  版权信息 (c) 2005-${(copyright.createDate)[0..3]} http://git.oschina.net/htengen
{  创建人：  ${copyright.author}
{  审查人：
{  模块：${table.tabComment?default(tableLabel)}											
{  功能描述:										
{															
{  ---------------------------------------------------------------------------	
{  维护历史:													
{  日期        维护人        维护类型						
{  ---------------------------------------------------------------------------	
{  ${copyright.createDate}  ${copyright.author}        新建	
{ 	                                                                     
{  ---------------------------------------------------------------------------
{  注：本模块代码由codgen代码生成工具辅助生成 http://www.oschina.net/p/codgen	
{*****************************************************************************	
*/
</#if>